# Перемножить все нечётные цифры в диапазоне от 1 до 100
# c = 1
# for i in range(1,101,2):
#     c *= i
# print(c)




# Массив (cписок) из чисел от 1 до 500 кратных 5
# a = []
# for i in range(1,501):
#     if i % 5 == 0:
#         a.append(i)
# print(a)




# Все чётные значения от 1 до 497
# for i in range(1,498):
#     if i % 2 == 0:
#         print(i)




# Если число в первом списке встречается более 2-х раз, добавить его в другой список
# s1 = [1,2,3,4,5,6,5,4,3,2,1,2,3,4,5]
# print(s1)
# s2 = []
# for i in s1:
#     if s1.count(i) > 2:
#         s2.append(i)
# print(s2)